#+TITLE: DB Agenda
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Agenda DB330 Database Theory and Applications
#+STARTUP: overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
** SQLite Lab session

   You should type the commands shown here into your own SQLite shell
   to get some practice -

   * To open SQLite under Windows, open a CMD shell and type
     ~sqlite3~. If this does not work, you either have not installed
     the program, or you don't have the location of the executable
     ~sqlite3.exe~ in the ~$PATH~ of your PC.

   * To find the ~$PATH~ to the executable, open an ~*eshell*~ in Emacs
     (~M-x eshell~) and type ~which sqlite3~ (that's a Linux shell command,
     and Emacs simulates Linux shell commands using Emacs Lisp).

   * Inside SQLite, on the SQLite shell (indicated by the prompt
     ~sqlite>~), you need to operate with a persistent database file
     that must have the ending ~*.db~.

   * The output to the code in [[check_db]] shows 1) we have a persistent
     database that we're currently writing to, 2) where the file is, 3)
     we have no tables (yet).
     #+name: check_db
     #+begin_src sqlite :db sqlite.db :results output :exports both
       .database
       .tables
     #+end_src

     #+RESULTS:
     : main: c:\Users\birkenkrahe\Documents\GitHub\db330\sqlite.db r/w
     : 1,"Jimmy Jones"
     : 2,"Jane Jackson"

   * To create a table, we need SQL commands (not just SQLite shell
     commands). In [[create]], the SQL keywords are all capitalized though
     SQLite doesn't actually care about that.
     #+name: create
     #+begin_src sqlite :db sqlite.db :results silent :exports both
       CREATE TABLE customer (id INT, name TEXT);
     #+end_src
     - ~customer~ is the name of our table
     - ~id~ and ~name~ are the two columns of our table (stuff we wish
       to store)
     - ~INT~ and ~TEXT~ are two SQLite data types

   * ~CREATE TABLE~ is a DDL (Data Definition Language) command. We
     now have a table but no content.
     #+name: .tables
     #+begin_src sqlite :db sqlite.db :exports both
       .tables
     #+end_src

     #+RESULTS: .tables
     : customer

   * ~INSERT INTO~ is a DML (Data Manipulation Language) command. We
     insert two lines. The result is silent.
     #+name: insert
     #+begin_src sqlite :db sqlite.db :results silent :exports both
       INSERT INTO customer VALUES (1,"Jimmy Jones");
       INSERT INTO customer VALUES (2,"Jane Jackson");
     #+end_src

   * To look at what we've entered, we use the ~SELECT~ command, a DQL
     (Data Query Language) command.
     #+name: select
     #+begin_src sqlite :db sqlite.db :exports both
       SELECT * FROM customer;
     #+end_src
     - This command is best understood as a data pipeline (more later)
     - Its general form is ~SELECT [cols] FROM [table] [filter]~
     - The wildcard symbol ~*~ means "all columns" of the table

     #+RESULTS: select
     | 1 | Jimmy Jones  |
     | 2 | Jane Jackson |

** Review of DataCamp (interactive)

   * Review dashboard: SQL shell / table view

   * ~AS~ is an alias operator: it is used in [[as]] as an alias for the
     column name.
     #+name: AS
     #+begin_src sqlite :db sqlite.db
     .header ON
     .mode column
     SELECT name AS result FROM customer;
     #+end_src

     #+RESULTS:
     | result       |
     | ------------ |
     | Jimmy Jones  |
     | Jane Jackson |

   * The ~AS~ in DataCamp created a column. You can use ~SELECT~ to
     "pipe" anything into a table format.
     #+name: AS1
     #+begin_src sqlite :db select.db
      .header ON
      .mode column
      SELECT 'Hello world' AS hello;
     #+end_src

     #+RESULTS: as1
     | hello       |
     | ----------- |
     | Hello world |

   * Demonstration of ~DISTINCT~ using our table ~customer~.
     #+name: DISTINCT
     #+begin_src sqlite :db sqlite.db
       .header ON
       .mode column
       INSERT INTO customer VALUES (3,"Jimmy Jones");
       SELECT * FROM customer;
       SELECT DISTINCT name AS dist_name FROM customer;
       DELETE FROM customer WHERE id=3;
     #+end_src

     #+RESULTS: DISTINCT
     | id  name         |
     | --  ------------ |
     | 1   Jimmy Jones  |
     | 2   Jane Jackson |
     | 3   Jimmy Jones  |
     | dist_name        |
     | ------------     |
     | Jimmy Jones      |
     | Jane Jackson     |

   * Demonstration of ~COUNT~ using our table ~customer~.
     #+name: COUNT
     #+begin_src sqlite :db sqlite.db :results output
       SELECT COUNT(*) FROM customer;
       INSERT INTO customer VALUES (3,"Arabela Ant");
       SELECT COUNT(*) FROM customer;
     #+end_src

     #+RESULTS: COUNT
     : 2
     : 3

